
第一行答案：
最小的正非规格化数，要满足一下几个条件
1. 符号位为1
2. 阶码位全部为0
3. 单独的整数位为0
4. 小数位最后一位为1，其他都为0
得出的结论是： 0 000..00(15位) 0 000..01(63位)

偏量bias = 2^(k-1) - 1 = 2^(15-1) - 1 = 2^14 - 1
E = 1 - bias = 1 - 2^14 + 1 = 2 - 2^14
V = M * 2^E = 2^(-63) * 2^(2 - 2^14) = 2^(-63 + 2 - 2^14) = 2^(-61-2^14)



第二行答案：
最小的正规格数，满足下边几个条件
1. 符号位为0
2. 阶码位为1
3. 按照该题目要求，单独的整数位为1
4. 小数位全是0
得出的结论是： 0 000..01(15位) 1 000..00(63位)

偏量bias = 2^(k-1) - 1 = 2^(15-1) - 1 = 2^14 - 1
E = e - bias = 1 - 2^14 + 1 = 2 - 2^14
V = M * 2^E = 1 * 2^(2 - 2^14)



第三行答案：
最大的规格数，满足下边几个条件
1. 符号位为0
2. 阶码位全为1
3. 按照该题目要求，单独的整数位为1
4. 小数位全是1
得出的结论是： 0 111..10(15位) 1 111..11(63位)

偏量bias = 2^(k-1) - 1
E = e - bias = 2^15 - 2 - bias
V = M * 2^E = M * 2^(2^15 - 2 - bias) = M * 2^(2^14 * 2 - 2 - bias)
= M * 2^(2bias - bias) = M * 2^bias
此时M = 1 + (1 - 2^-63) = 2 - 2^-63
得出最终的结果是：2^bias * (2 - 2^-63)